%%%-------------------------------------------------------------------
%%% @author יובל סער
%%% @copyright (C) 2021, <COMPANY>
%%% @doc
%%%
%%% @end
%%% Created : 04. אוג׳ 2021 17:18
%%%-------------------------------------------------------------------
-module(file_functions).
-author("יובל סער").

%% API
-export([split_file/2]).

%%%===================================================================
%%% API
%%%===================================================================

split_file(File,AmountOfPieces) ->
  {ok,ListOfFilePieces}.

merge_file(ListOfFilePieces,Amount) ->
  {ok,File}.